Repository: StanfordBDHG/MyHeartCounts-iOS
Catalog: MyHeartCounts/Supporting Files/InfoPlist.xcstrings
Source language: en
Languages: es

# NSCameraUsageDescription
source: This message should never appear. Please adjust this when you start using camera information. We have to put this in here as ResearchKit has the possibility to use it and not putting it here returns an error on AppStore Connect.
es: Este mensaje no debería aparecer nunca. Por favor, ajuste esto cuando comience a utilizar información de la cámara. Debemos incluirlo aquí porque ResearchKit tiene la posibilidad de usarla y no incluirlo genera un error en AppStore Connect.

# NSHealthClinicalHealthRecordsShareUsageDescription
source: My Heart Counts uses Health data to understand all aspects of health.
es: My Heart Counts utiliza datos de la app Salud para comprender todos los aspectos de la salud.

# NSHealthShareUsageDescription
source: My Heart Counts uses Health data to understand all aspects of health.
es: My Heart Counts utiliza datos de HealthKit para comprender todos los aspectos de la salud.

# NSHealthUpdateUsageDescription
source: My Heart Counts can optionally save some Health information collected via surveys and other in-app mechanisms into the Health Data Store.
es: My Heart Counts puede guardar opcionalmente alguna información de Salud recolectada a través de encuestas y otros mecanismos de la aplicación en el Almacén de Datos de Salud.

# NSMotionUsageDescription
source: My Heart Counts uses motion data to conduct a timed walking test
es: My Heart Counts utiliza datos de movimiento para realizar una prueba de caminata cronometrada.

# NSSensorKitUsageDescription
source: Enabling SensorKit provides more accurate and in depth data for things like ECG to help advance cardiovascular research.
es: Al habilitar SensorKit, se obtienen datos más precisos y detallados para mediciones como el electrocardiograma (ECG), lo que contribuye al avance de la investigación cardiovascular.

# SENSORKIT_USAGE_DESC_ACCELEROMETER
source: SensorKit Accelerometer data helps us better interpret your timed walk test results.
es: Los datos del acelerómetro de SensorKit nos ayudan a interpretar mejor los resultados de su prueba de caminata cronometrada.

# SENSORKIT_USAGE_DESC_AMBIENT_LIGHT
source: Helps us better understand your environment and light exposure, which affects your circadian rhythms and may provide insights for providing more accurate physical activity prompts.
es: Nos ayuda a comprender mejor su entorno y la exposición a la luz, lo que afecta sus ritmos circadianos y puede aportar información para ofrecer indicaciones de actividad física más precisas.

# SENSORKIT_USAGE_DESC_AMBIENT_PRESSURE
source: SensorKit Ambient Pressure data helps us better interpret your timed walk test results.
es: Los datos de presión ambiental de SensorKit nos ayudan a interpretar mejor los resultados de su prueba de caminata cronometrada.

# SENSORKIT_USAGE_DESC_DEVICE_USAGE
source: Can help us identify phone usage patterns that help us provide more effective physical activity interventions.
es: Puedes ayudarnos a identificar patrones de uso del teléfono que nos permitan ofrecer intervenciones de actividad física más efectivas.

# SENSORKIT_USAGE_DESC_HEART_RATE
source: SensorKit Heart Rate data helps us better interpret your ECGs and timed walk test results.
es: Los datos de frecuencia cardíaca de SensorKit nos ayudan a interpretar mejor sus ECG y los resultados de las pruebas de caminata cronometradas.

# SENSORKIT_USAGE_DESC_ON_WRIST
source: SensorKit On-Wrist data helps us interpret your ECG and watch data more accurately.
es: Los datos On-Wrist de SensorKit nos ayudan a interpretar su ECG y los datos de su reloj con mayor precisión.

# SENSORKIT_USAGE_DESC_PEDOMETER
source: SensorKit Pedometer data helps us better interpret your timed walk test results.
es: Los datos del podómetro de SensorKit nos ayudan a interpretar mejor los resultados de su prueba de caminata cronometrada.

# SENSORKIT_USAGE_DESC_PPG
source: SensorKit PPG data helps us better interpret your ECGs and timed walk test results.
es: Los datos de fotopletismografía (PPG) de SensorKit nos ayudan a interpretar mejor tus ECG y los resultados de la prueba de caminata cronometrada.

# SENSORKIT_USAGE_DESC_WRIST_TEMP
source: Can help to detect early signs of health issues.
es: Puede ayudar a detectar signos tempranos de problemas de salud.
